cf_billing/InformationRegisters/энргЗначенияСоциальныхНормативов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЗначенияСоциальныхНормативов</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеНорматива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючНорматива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиНормативов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргЗначенияСоциальныхНормативов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет значения текущих социальных норм потребления.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция ЗначенияТекущихСоциальныхНормПотребления(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗначенияСоциальныхНормативов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, ТипНачисления, КлючНорматива, Услуга, НаправлениеИспользованияТУ";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
		Для Сч = 0 По ПараметрыОтбора.ПараметрыВТ.ВГраница() Цикл
			Если ПараметрыОтбора.ПараметрыВТ[Сч].ТипПараметра = "ТипПараметраВременнаяТаблица" Тогда
				Пакет.Операторы[0].Отбор.Очистить();
				СоотвествиеПолей 			= ПараметрыОтбора.ПараметрыВТ[Сч].СоотвествиеПолей;
				ОтборДляУстановки 			= Новый Структура("ИмяПараметра,ТипПараметра,СоотвествиеПолей", ПараметрыОтбора.ПараметрыВТ[Сч].ИмяПараметра,"ТипПараметраВременнаяТаблица", СоотвествиеПолей);
				энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"энргЗначенияСоциальныхНормативовСрезПоследних",ОтборДляУстановки, "");
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;	 	
		
	ВспомогательныеПоля 			= "Период,Регистратор,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецФункции

// Заполняет значения текущих социальных норм потребления коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		-	Строка.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗначенияТекущихСоциальныхНормПотребленияКоллекцияПериодов(Схема,ПараметрыОтбора,ТаблицаПериодов,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗначенияТекущихСоциальныхНормПотребленияКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, ТипНачисления, КлючНорматива, Услуга, НаправлениеИспользованияТУ";
		ИмяТаблицы 					= "ЗначенияСоциальныхНормативов";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);
	КонецЕсли;	 	
	
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает текст запроса значения социальных нормативов.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаЗначенияСоциальныхНормативов() Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСоциальныхНормативов.Организация КАК Организация,
	|	ЗначенияСоциальныхНормативов.Район КАК Район,
	|	ЗначенияСоциальныхНормативов.ТипНачисления КАК ТипНачисления,
	|	ЗначенияСоциальныхНормативов.КлючНорматива КАК КлючНорматива,
	|	ЗначенияСоциальныхНормативов.Услуга КАК Услуга,
	|	ЗначенияСоциальныхНормативов.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ЗначенияСоциальныхНормативов.ЗначениеНорматива КАК ЗначениеНорматива
	|ИЗ
	|	РегистрСведений.энргЗначенияСоциальныхНормативов.СрезПоследних КАК ЗначенияСоциальныхНормативов";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗначенияТекущихСоциальныхНормПотребленияКоллекцияПериодов()
	
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ТипНачисления КАК ТипНачисления,
	|	ВложенныйЗапрос.КлючНорматива КАК КлючНорматива,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ЗначенияСоциальныхНормативов.ЗначениеНорматива КАК ЗначениеНорматива
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
	|		ЗначенияСоциальныхНормативов.Организация КАК Организация,
	|		ЗначенияСоциальныхНормативов.Район КАК Район,
	|		ЗначенияСоциальныхНормативов.ТипНачисления КАК ТипНачисления,
	|		ЗначенияСоциальныхНормативов.КлючНорматива КАК КлючНорматива,
	|		ЗначенияСоциальныхНормативов.Услуга КАК Услуга,
	|		ЗначенияСоциальныхНормативов.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		МАКСИМУМ(ЗначенияСоциальныхНормативов.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.энргЗначенияСоциальныхНормативов КАК ЗначенияСоциальныхНормативов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|			ПО ЗначенияСоциальныхНормативов.Организация = ТаблицаПериодов.Организация
	|				И ЗначенияСоциальныхНормативов.Район = ТаблицаПериодов.Район
	|				И ЗначенияСоциальныхНормативов.Период < ТаблицаПериодов.ЗавершениеОП
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаПериодов.ПериодНачисления,
	|		ЗначенияСоциальныхНормативов.Организация,
	|		ЗначенияСоциальныхНормативов.Район,
	|		ЗначенияСоциальныхНормативов.ТипНачисления,
	|		ЗначенияСоциальныхНормативов.КлючНорматива,
	|		ЗначенияСоциальныхНормативов.Услуга,
	|		ЗначенияСоциальныхНормативов.НаправлениеИспользованияТУ) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияСоциальныхНормативов КАК ЗначенияСоциальныхНормативов
	|		ПО ВложенныйЗапрос.Организация = ЗначенияСоциальныхНормативов.Организация
	|			И ВложенныйЗапрос.Район = ЗначенияСоциальныхНормативов.Район
	|			И ВложенныйЗапрос.ТипНачисления = ЗначенияСоциальныхНормативов.ТипНачисления
	|			И ВложенныйЗапрос.КлючНорматива = ЗначенияСоциальныхНормативов.КлючНорматива
	|			И ВложенныйЗапрос.Услуга = ЗначенияСоциальныхНормативов.Услуга
	|			И ВложенныйЗапрос.НаправлениеИспользованияТУ = ЗначенияСоциальныхНормативов.НаправлениеИспользованияТУ
	|			И ВложенныйЗапрос.Период = ЗначенияСоциальныхНормативов.Период";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
